2022-01-05-el-empaquetador-tar.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>El empaquetador tar</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">05 ene 2022</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2022-01-05-el-empaquetador-tar.html"
          >El empaquetador tar</a
        >
      </h1>
      <p>Empaquetar archivos y directorios.</p>

      <div id="outline-container-orgcc60ce0" class="outline-2">
        <h2 id="orgcc60ce0">Descripción</h2>
        <div class="outline-text-2" id="text-orgcc60ce0">
          <p>
            El programa tar, es usado para almacenar archivos y directorios en
            un solo archivo, no para comprimirlos. Dentro de los entornos Unix
            tar aparece como una orden que puede ser ejecutada desde la línea de
            órdenes de una consola de texto o desde un simple terminal. Donde
            &lt;archivoSalida&gt; es el archivo resultado y &lt;archivo1&gt;,
            &lt;archivo2&gt;, etcétera son los diferentes archivos que serán
            "empaquetados" en &lt;archivoSalida&gt;. Este proceso permite
            respaldar archivos, compartirlos, transmitirlos por Internet o por
            redes locales de una forma fácil.
          </p>
        </div>
      </div>

      <div id="outline-container-orgc1c4540" class="outline-2">
        <h2 id="orgc1c4540">Opciones más usadas</h2>
        <div class="outline-text-2" id="text-orgc1c4540">
          <ul class="org-ul">
            <li>
              <b>-c</b> Crea un archivo tar que contiene los elementos
              especificados.
            </li>
            <li><b>-x</b> Extrae el archivo de almacenamiento al disco.</li>
            <li><b>-t</b> Listar el contenido del archivo tar.</li>
            <li>
              <b>-f</b> Especifica el nombre del archivo de almacenamiento.
            </li>
            <li><b>-v</b> Visualizar lo que se realiza.</li>
            <li>
              <b>-j</b> Se utiliza para comprimir el archivo a con de bzip2.
            </li>
            <li>
              <b>-z</b> Se utiliza para comprimir el archivo a con de gzip.
            </li>
          </ul>
          <p>
            <b>+ -r</b> Se utiliza para agregar o actualizar un archivo
            existente con archivos o directorios
          </p>
          <ul class="org-ul">
            <li>
              <b>-u</b> Como -r, pero las nuevas entradas se agregan solo si
              tienen una fecha de modificación más reciente que la entrada
              correspondiente en el archivo.
            </li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgbc68acb" class="outline-2">
        <h2 id="orgbc68acb">Ejemplos</h2>
        <div class="outline-text-2" id="text-orgbc68acb"></div>
        <ul class="org-ul">
          <li>
            <a id="org6c88008"></a>Crear archivo tar sin comprimir<br />
            <div class="outline-text-5" id="text-org6c88008">
              <pre class="example">
$ tar -cvf /path/to/foo.tar /path/to/foo/
</pre
              >

              <p>
                Dónde ‘/path/to/foo.tar‘ es la ubicación del archivo tar
                resultante (con extención tar) y ‘/path/to/foo’ es la ubicación
                del archivo o directorio que se utilizará como entrada, las
                rutas pueden ser ralativas o absolutas.
              </p>
            </div>
          </li>

          <li>
            <a id="org726c341"></a>Todos los archivos que comienzan con una
            letra<br />
            <div class="outline-text-5" id="text-org726c341">
              <pre class="example">
# tar -cvf fullbackup.tar i*
install.log
install.log.syslog
</pre
              >
            </div>
          </li>

          <li>
            <a id="org46c8724"></a>Agregar un archivo al tar existente<br />
            <div class="outline-text-5" id="text-org46c8724">
              <pre class="example">
# tar --append --file=backup.tar anaconda-ks.cfg
</pre
              >
            </div>
          </li>

          <li>
            <a id="orgc622b26"></a>Extraer archivos de un tar<br />
            <div class="outline-text-5" id="text-orgc622b26">
              <pre class="example">
$ tar -xvf /path/to/foo.tar
</pre
              >
            </div>
          </li>

          <li>
            <a id="org05468e8"></a>Extraer archivos de un tar en un directorio
            especifico<br />
            <div class="outline-text-5" id="text-org05468e8">
              <pre class="example">
$ tar -xvf /path/to/foo.tar -C /path/to/destination/
</pre
              >
            </div>
          </li>

          <li>
            <a id="org25121eb"></a>Extraer un archivo del archivo tar<br />
            <div class="outline-text-5" id="text-org25121eb">
              <pre class="example">
$ tar --extract -vv --occurrence --file=./backup.tar anaconda-ks.cfg
</pre
              >
            </div>
          </li>

          <li>
            <a id="org086fb89"></a>Listar el contenido de tar<br />
            <div class="outline-text-5" id="text-org086fb89">
              <pre class="example">
$ tar -ztvf /path/to/foo.tgz
</pre
              >
            </div>
          </li>

          <li>
            <a id="org3780161"></a>Crear, extraer y listar un archivo .gz con
            tar<br />
            <div class="outline-text-5" id="text-org3780161">
              <p>Crear</p>

              <pre class="example">
$ tar -czvf /path/to/foo.tgz /path/to/foo/
</pre
              >

              <p>Extraer</p>

              <pre class="example">
$ tar -xzvf /path/to/foo.tgz /path/to/foo/
</pre
              >

              <p>Listar</p>

              <pre class="example">
$ tar -ztvf /path/to/foo.tgz /path/to/foo/
</pre
              >
            </div>
          </li>

          <li>
            <a id="org310d385"></a>Crear, extraer y listar un archivo .bz2<br />
            <div class="outline-text-5" id="text-org310d385">
              <p>Crear</p>

              <pre class="example">
$ tar -czvf /path/to/foo.tgz /path/to/foo/
</pre
              >

              <p>Extraer</p>

              <pre class="example">
$ tar -xjvf /path/to/foo.tgz /path/to/foo/
</pre
              >

              <p>Listar</p>

              <pre class="example">
$ tar -jtvf /path/to/foo.tgz /path/to/foo/
</pre
              >
            </div>
          </li>
        </ul>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
